      ******************************************************************
      * Author: Erik Eriksen
      * Create Date: 2020-11-10
      * Last Modified: 2020-11-10
      * Purpose: File description for data file that stores last
      *          ID retreived and saved.
      * Tectonics: ./build.sh
      ******************************************************************
           FD rss-last-id-file.
           01 rss-last-id-record               pic 9(5) value zeros.
