      ******************************************************************
      * Author: Erik Eriksen
      * Create Date: 2020-11-10
      * Last Modified: 2020-11-10
      * Purpose: Working storage definition for rss_last_id_file file
      *          descriptor.
      * Tectonics: ./build.sh
      ******************************************************************
       01  ws-last-id-record                   pic 9(5) value zeros.
